Repository: bkil/selinux-coloring-book
Catalog: SRC/*/selinux-coloring-book.po
Languages: hu

source: COLORING BOOK
hu: SZÍNEZŐKÖNYV

source: written by
hu: írta:

source: illustrated by
hu: rajzolta:

source: "It's raining cats and dogs!"
hu: „Macskák és kutyák hullanak az égből!”

source: the
hu: A

source: LEARN
hu: TANULJ

source: as you
hu: színezés

source: COLOR!
hu: KÖZBEN!

source: CAT
hu: CICA

source: DOG
hu: KUTYA

source: Type Enforcement
hu: Típuskényszerítés

source: The SELinux primary model of enforcement is called type enforcement.
hu: A SELinux kényszerítés elsődleges modelljét típuskényszerítésnek hívják.

source: Basically this means we define the label on a process based on its type,
hu: Alapvetően ez azt jelenti, hogy egy folyamaton a címkét annak típusa alapján,

source: and the label on a file system object based on its type.
hu: és egy fájlrendszer-objektum címkéjét annak típusa alapján határozunk meg.

source: Imagine a system where we define types on objects like cats and dogs.
hu: Képzelj egy rendszert, ahol objektumtípusokat határozunk meg mint cicák és kutyák.

source: A cat and dog are process types.
hu: A cica és a kutya folyamattípusok.

source: PROCESS TYPES
hu: FOLYAMATTÍPUSOK

source: CAT_CHOW
hu: CICAKAJA

source: OBJECT TYPES
hu: OBJEKTUMTÍPUSOK

source: ALLOW
hu: ENGEDÉLYEZÉS

source: POLICY RULES
hu: HÁZIREND SZABÁLYOK

source: We have a class of objects that they want to interact with which we call
hu: Objektumosztályaink vannak, amelyekkel interakcióba akarnak lépni. Ezt ételnek

source: food. And I want to add types to the food, cat_chow and dog_chow.
hu: nevezünk. És az ételhez típusokat akarok adni, cicakaja és kutyakaja.

source: As a policy writer, I would say that a dog has permission to eat dog_chow
hu: Házirendíróként azt mondanám, hogy egy kutya jogosult a kutyakaja ételt

source: write this rule in policy, as shown below.
hu: szabályt úgy írnánk a házirendbe, ahogy alább látható.

source: DOG_CHOW
hu: KUTYAKAJA

source: CAT_CHOW<_:tspan-1/>FOOD
hu: CICAKAJA<_:tspan-1/>ÉTEL

source: EAT
hu: ENNI

source: DOG_CHOW<_:tspan-1/>FOOD
hu: KUTYAKAJA<_:tspan-1/>ÉTEL

source: food and a cat has permission to eat cat_chow food. In SELinux we would
hu: enni, és egy cica jogosult a cicakaja ételt enni. A SELinuxban ezt a

source: YUMMY!
hu: NYAMM!

source: DELICIOUS!
hu: FINCSI!

source: DOG_CHOW:FOOD
hu: KUTYAKAJA:ÉTEL

source: CAT_CHOW:FOOD
hu: CICAKAJA:ÉTEL

source: With these rules the kernel would allow the cat process to eat food labeled
hu: Ezekkel a szabályokkal a rendszermag engedélyezné a cica folyamatnak a

source: cat_chow and the dog to eat food labeled dog_chow.
hu: cicakaja címkéjű, és a kutyának a kutyakaja címkéjű étel evését.

source: KERNEL
hu: RENDSZERMAG

source: But in an SELinux system everything is denied by default. This means that if
hu: De egy SELinux rendszerben alaphelyzetben minden tiltott. Ez azt jelenti, hogy

source: the dog process tried to eat the cat_chow, the kernel would prevent it.
hu: ha a kutya folyamat cicakaját próbálna enni, a rendszermag megakadályozná.

source: Likewise cats would not be allowed to touch dog food.
hu: Ugyanúgy a cicáknak sem volna szabad kutyaételhez nyúlniuk.

source: NO! BAD CAT!
hu: NEM! ROSSZ CICA!

source: DON'T EAT THAT!
hu: NE EDD MEG AZT!

source: We've typed the dog process and cat process, but what happens if you have
hu: Leírtuk a kutyafolyamatot és a cicafolyamatot, de mi történik, ha több

source: multiple dogs processes: Fido and Spot. You want to stop Fido from eating
hu: kutyafolyamatod van: Fido és Spot. Meg akarod akadályozni, hogy Fido egyen

source: Spot's dog_chow.
hu: Spot kutyakaja ételéből.

source: MCS Enforcement
hu: MCS kényszerítés

source: One solution would be to create lots of new types, like Fido_dog and
hu: Egy megoldás lehetne rengeteg új típus létrehozása, mint Fido_kutya és

source: Fido_dog_chow. But, this will quickly become unruly because all dogs
hu: Fido_kutyakaja. De ez gyorsan engedetlenné válik, mert az összes kutya

source: have pretty much the same permissions.
hu: nagyjából ugyanazokkal a jogosultságokkal rendelkezik.

source: To handle this we developed a new form of enforcement, which we call
hu: Ennek kezelésére a kényszerítés új formáját fejlesztettük ki, amelyet több-

source: Multi Category Security (MCS). In MCS, we add another section of the label
hu: kategóriás biztonságnak (MCS) hívunk. Az MCS-ben hozzáadjuk a címke egy másik

source: which we can apply to the dog process and to the dog_chow food. Now we
hu: szakaszát, amelyet alkalmazhatunk a kutyafolyamatra és a kutyakaja ételre.

source: label the dog process as dog:random1 (Fido) and dog:random2 (Spot).
hu: Most a kutyafolyamat címkéi kutya:valami1 (Fido) és kutya:valami2 (Spot).

source: DOG:RANDOM1
hu: KUTYA:VALAMI1

source: DOG:RANDOM2
hu: KUTYA:VALAMI2

source: We label the dog chow as dog_chow:random1 (Fido) and
hu: A kutyakaját úgy címkézzük, hogy kutyakaja:valami1 (Fido)

source: dog_chow:random2 (Spot).
hu: és kutyakaja:valami2 (Spot).

source: DOG_CHOW:
hu: KUTYAKAJA:

source: RANDOM1
hu: VALAMI1

source: RANDOM2
hu: VALAMI2

source: MCS rules say that if the type enforcement rules are OK and the random MCS labels
hu: Ha az MCS-szabályok alapján a típuskényszerítő szabályok rendben vannak és

source: match exactly, then the access is allowed, if not it is denied.
hu: valami MCS-címkék pontosan illeszkednek, akkor hozzáférhető, egyébként tiltott.

source: Fido (dog:random1) trying to eat cat_chow:food is denied by type
hu: Fido (kutya:valami1) próbál cicakaja:ételt enni, de a típuskényszerítés

source: enforcement.
hu: megtiltja.

source: Fido (dog:random1) is allowed to eat dog_chow:random1.
hu: Fido (kutya:valami1) ehet a kutyakaja:valami1 ételből.

source: TYPE ENFORCEMENT
hu: TÍPUSKÉNYSZERÍTÉS

source: DOG<_:tspan-1/>RANDOM1
hu: KUTYA<_:tspan-1/>VALAMI1

source: DOG_CHOW<_:tspan-1/>RANDOM1
hu: KUTYAKAJA<_:tspan-1/>VALAMI1

source: Fido (dog:random1) denied to eat spot's (dog_chow:random2) food.
hu: Fido (kutya:valami1) nem ehet Spot (kutyakaja:valami2) ételéből.

source: DOG_CHOW<_:tspan-1/>SPOT
hu: KUTYAKAJA<_:tspan-1/>SPOT

source: DOG<_:tspan-1/>
hu: KUTYA<_:tspan-1/>

source: MCS ENFORCEMENT
hu: MCS KÉNYSZERÍTÉS

source: Another form of SELinux enforcement, used much less frequently, is called
hu: A SELinux kényszerítés egy másik, sokkal ritkábban használt formáját több-

source: Multi Level Security (MLS); it was developed back in the 60s and is used
hu: szintű biztonságnak (MLS) hívják. A 60-as években fejlesztették ki, és főleg

source: mainly in trusted operating systems like Trusted Solaris.
hu: megbízható operációs rendszereknél használták, mint például a Trusted Solaris.

source: The main idea is to control processes based on the level of the data they
hu: Az alapötlet a folyamatoknak az adatok azon szintje alapján való szabályzása,

source: will be using. A secret process can not read top secret data.
hu: amelyet használni fognak. Egy titkos folyamat nem tud bizalmas adatot olvasni.

source: Instead of talking about different dogs, we now look at different breeds.
hu: A különböző kutyákról való beszélgetés helyett nézzük a különböző fajtákat.

source: We might have a Greyhound and a Chihuahua.
hu: Lehet, hogy van egy agárunk és egy csivavánk.

source: MLS Enforcement
hu: MLS kényszerítés

source: GREYHOUND
hu: AGÁR

source: CHIHUAHUA
hu: CSIVAVA

source: We might want to allow the Greyhound to eat any dog food, but a Chihuahua
hu: Meg akarjuk engedni az agárnak, hogy bármilyen kutyakaját egyen, de egy csivava

source: could choke if it tried to eat Greyhound dog food.
hu: megfulladhat, ha megpróbál enni az agár kutyakajájából.

source: We want to label the Greyhound as dog:Greyhound and his dog food as
hu: Az agarat kutya:agár címkével, a kutyakajáját kutya_kaja:agár címkével

source: dog_chow:Greyhound, and label the Chihuahua as dog:Chihuahua and his
hu: szeretnénk ellátni, míg a csivava kutya:csivava és a kutyakajája

source: food as dog_chow:Chihuahua.
hu: kutyakaja:csivava címkét fog kapni.

source: DOG_CHOW<_:tspan-1/>CHIHUAHUA
hu: KUTYAKAJA<_:tspan-1/>CSIVAVA

source: DOG_CHOW<_:tspan-1/>GREYHOUND
hu: KUTYAKAJA<_:tspan-1/>AGÁR

source: With the MLS policy, we would have the MLS Greyhound label dominate the
hu: Az MLS házirenddel az MLS agár címke uralná a csivava címkét. Ez azt

source: Chihuahua label. This means dog:Greyhound is allowed to eat
hu: jelenti, hogy a kutya:agár számára megengedett a kutyakaja:agár és a

source: dog_chow:Greyhound and dog_chow:Chihuahua.
hu: kutyakaja:csivava evése.

source: DOG_CHOW<_:tspan-1/>
hu: KUTYAKAJA<_:tspan-1/>

source: DOG<_:tspan-1/>GREYHOUND
hu: KUTYA<_:tspan-1/>AGÁR

source: DOG_CHOW<_:tspan-1/><_:tspan-2/>
hu: KUTYAKAJA<_:tspan-1/><_:tspan-2/>

source: DOG<_:tspan-1/>CHIHUAHUA
hu: KUTYA<_:tspan-1/>CSIVAVA

source: But dog:Chihuahua is not allowed to eat dog_chow:Greyhound.
hu: De a kutya:csivava számára nem engedélyezett a kutyakaja:agár evése.

source: THIS IS A BIT
hu: EZ EGY KICSIT

source: TOO BEEFY
hu: TÚL HÚSOS

source: FOR YOU...
hu: NEKED…

source: Of course, dog:Greyhound and dog:Chihuahua are still prevented from
hu: Természetesen a típuskényszerítés továbbra is megakadályozza a kutya:agár

source: eating cat_chow:Siamese by type enforcement, even if the MLS type
hu: és kutya:csivava számára a cicakaja:sziámi evését, akkor is ha az agár

source: Greyhound dominates Siamese.
hu: MLS-típus uralja a sziámit.

source: CAT_CHOW:
hu: CICAKAJA:

source: SIAMESE
hu: SZIÁMI

source: Learn more at opensource.com:
hu: Tudj meg többet az opensource.com címen:
